puts " -< ƒ¥à®¨ ‚« áâ¥«¨­  Š®«ìæ  -vs- ƒ¥à®¨ ƒ àà¨ ®ââ¥à  v. 0.0.1 >- ".to_center()

class Settings
	def Init()
		@commands = 
		{
			"‹¥£¥­¤ à­ë¥ „ïâ«ë" =>
				{   :Players =>
					{
						" «¨­" => 			{ :Speed => 13 },
						"„¢ «¨­" => 		{ :Speed => 15 },
						"‹¥£®« §" => 		{ :Speed => 3 },
						"”à®¤®" => 			{ :Speed => 8 },
						"‘í¬" => 			{ :Speed => 9 },
						"ƒ¥­¤ «ìä ¡¥«ë©" => { :Speed => 14 },
						"ƒ¥­¤ «ìä á¥àë©" => { :Speed => 10 },
						"‘ ãà®­" =>			{ :Speed => 18 },
						"¨«ì¡® í££¨­á" => { :Speed => 21 },
						"Œíàà¨" => 			{ :Speed => 14 },
						"¨¯¯¨­" =>			{ :Speed => 14 },
						"€à £®à­" =>		{ :Speed => 11 },
						"«à®­¤" =>			{ :Speed => 16 },
						"‘ àã¬ ­ " =>		{ :Speed => 12 },
						"®à®¬¨à" =>		{ :Speed => 15 },
						"ƒ¨¬«¨" =>			{ :Speed => 13 },
						"’®¬ ®¬¡ ¤¨«" =>	{ :Speed => 14 }
					}
				},
			"‚®«è¥¡­ë¥ ’ã¯®­®áë" =>
				{
					:Players =>
					{
						"‚®« ­¤¥¬®àâ" => 	{ :Speed => 14 },
						"ƒ àà¨ ®ââ¥à" =>	{ :Speed => 13 },
						"ƒ¥à¬¨®­ " => 		{ :Speed => 11 },
						"®­ “¨§«¨" => 		{ :Speed => 18 },
						"„ ¬¡«¤®à" => 		{ :Speed => 10 },
						"‘­¥©¯" =>	 		{ :Speed => 10 },
						"„¦¨­­¨ “¨§«¨" => 	{ :Speed => 4 },
						"„¦¥©¬á ®ââ¥à" =>	{ :Speed => 6 },
						"‹¨«¨ ¢ ­á" =>		{ :Speed => 6 },
						"„à ª® Œ «ä®©" =>	{ :Speed => 6 },
						"¨â¥à  ¥ââ¨£àî" =>{ :Speed => 6 },
						"‘¨à¨ãá «íª" =>	{ :Speed => 6 },
						"”«ñà „¥« ªãà" => 	{ :Speed => 2 },
						"€à£ãá ”¨«ç" =>		{ :Speed => 6 },
						"ã¡¥ãá • £à¨¤" => 	{ :Speed => 2 },
						"Œ ª£®­ £ ««" => 	{ :Speed => 2 }
					}
				},
			""=>4
		}
	end
end