8/Курсовой/СидоровИС-521703/src/app/controllers/bugs_controller.rb

  def index
	@bugs = @build.bugs.all
---
SELECT * FROM `bugs` WHERE (`bugs`.build_id = 953125641)

  def show
    @bug = @build.bugs.find(params[:id])
---
SELECT * FROM `bugs` WHERE (`bugs`.`id` = 953125641 AND (`bugs`.build_id = 953125641))

  def edit
    @bug = @build.bugs.find(params[:id])
---
SELECT * FROM `bugs` WHERE (`bugs`.`id` = 953125641 AND (`bugs`.build_id = 953125641))

  def create
    @bug = @build.bugs.new(params[:bug])

    respond_to do |format|
      if @bug.save
---
INSERT INTO `bugs` (`steps_to_reproduce`, `created_at`, `title`, `build_id`, `updated_at`, `description`, `bug_status_id`) VALUES(NULL, '2009-05-17 14:33:59', 'a bug', 953125641, '2009-05-17 14:33:59', 'and his description', 2)

  def update
    @bug = @build.bugs.find(params[:id])

    respond_to do |format|
      if @bug.update_attributes(params[:bug])
---
SELECT * FROM `bugs` WHERE (`bugs`.`id` = 953125641 AND (`bugs`.build_id = 953125641))
UPDATE `bugs` SET `updated_at` = '2009-05-17 14:35:19', `title` = 'olelo' WHERE `id` = 953125641

  def destroy
    @bug = @build.bugs.find(params[:id])
    @bug.destroy
---
SELECT * FROM `bugs` WHERE (`bugs`.`id` = 953125641 AND (`bugs`.build_id = 953125641))
DELETE FROM `bugs` WHERE `id` = 953125641