8/Курсовой/СидоровИС-521703/src/app/controllers/builds_controller.rb

SELECT * FROM `builds` WHERE (`builds`.project_id = 1)
---
  def index
	@builds = @project.builds.all

SELECT * FROM `builds` WHERE (`builds`.`id` = 953125641 AND (`builds`.project_id = 1))
---
  def show
    @build = @project.builds.find(params[:id])

SELECT * FROM `builds` WHERE (`builds`.`id` = 953125641 AND (`builds`.project_id = 1))
---
  def edit
    @build = @project.builds.find(params[:id])

INSERT INTO `builds` (`created_at`, `title`, `build_status_id`, `project_id`, `updated_at`, `description`) VALUES('2009-05-17 14:54:57', 'b', 996332877, 1, '2009-05-17 14:54:57', 'descr')
---
  def create
    @build = @project.builds.new(params[:build])

    respond_to do |format|
      if @build.save

SELECT * FROM `builds` WHERE (`builds`.`id` = 953125641 AND (`builds`.project_id = 1))
UPDATE `builds` SET `updated_at` = '2009-05-17 18:07:06', `build_status_id` = 4 WHERE `id` = 6
---
  def update
    @build = @project.builds.find(params[:id])

    respond_to do |format|
      if @build.update_attributes(params[:build])

SELECT * FROM `builds` WHERE (`builds`.`id` = 953125641 AND (`builds`.project_id = 1))
DELETE FROM `builds` WHERE `id` = 953125641
---
  def destroy
    @build = @project.builds.find(params[:id])
    @build.destroy