8/Курсовой/СидоровИС-521703/src/app/controllers/issues_controller.rb

SELECT * FROM `issues` WHERE (`issues`.project_id = 1)
---
  def index
	@issues = @project.issues.all

SELECT * FROM `issues` WHERE (`issues`.`id` = 953125641 AND (`issues`.project_id = 1))
---
  def show
    @issue = @project.issues.find(params[:id])

SELECT * FROM `issues` WHERE (`issues`.`id` = 953125641 AND (`issues`.project_id = 1))
---
  def edit
    @issue = @project.issues.find(params[:id])

INSERT INTO `issues` (`created_at`, `title`, `project_id`, `updated_at`, `issue_status_id`, `description`) VALUES('2009-05-17 14:40:01', 'hello', 1, '2009-05-17 14:40:01', 2, 'desc')
---
  def create
    @issue = @project.issues.new(params[:issue])

    respond_to do |format|
      if @issue.save

SELECT * FROM `issues` WHERE (`issues`.`id` = 953125641 AND (`issues`.project_id = 1))
---
  def update
    @issue = @project.issues.find(params[:id])

SELECT * FROM `issues` WHERE (`issues`.`id` = 953125641 AND (`issues`.project_id = 1))
DELETE FROM `issues` WHERE `id` = 953125641
---
  def destroy
    @issue = @project.issues.find(params[:id])
    @issue.destroy