8/Курсовой/СидоровИС-521703/src/app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
	return redirect_to_dashboard('Такого проекта не существует') unless @projects.include?(@project)
	@builds = @project.builds.all :limit=>3
	@roles = @project.roles.all :limit=>3
	@bugs = @project.bugs.all :limit=>3
	@tasks = @project.tasks.all :limit=>3
	@issues = @project.issues.all :limit=>3
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
SELECT * FROM `builds` WHERE (`builds`.project_id = 3) LIMIT 3
SELECT * FROM `roles` WHERE (`roles`.project_id = 3) LIMIT 3
SELECT `bugs`.* FROM `bugs` INNER JOIN `builds` ON `bugs`.build_id = `builds`.id WHERE ((`builds`.project_id = 3)) LIMIT 3
SELECT * FROM `tasks` WHERE (`tasks`.project_id = 3) LIMIT 3
SELECT * FROM `issues` WHERE (`issues`.project_id = 3) LIMIT 3

  def create
	@project = Project.new(params[:project])
    respond_to do |format|
      if @project.save
		 role_template = RoleTemplate.find(1)
		 @role = Role.new
		@role.title = role_template.title
		@role.description = role_template.description
		 @role.role_template = role_template
		 @role.user = current_user
		 @role.project = @project
		if @role.save
---
INSERT INTO `projects` (`created_at`, `title`, `updated_at`, `project_status_id`, `description`) VALUES('2009-05-17 14:21:18', 'project_title', '2009-05-17 14:21:18', NULL, 'descr')
SELECT * FROM `role_templates` WHERE (`role_templates`.`id` = 1)
INSERT INTO `roles` (`created_at`, `title`, `project_id`, `role_template_id`, `updated_at`, `user_id`, `description`) VALUES('2009-05-17 14:21:18', 'MyString', 3, 1, '2009-05-17 14:21:18', 2, 'MyText')

  def update
    @project = Project.find(params[:id])
	return redirect_to_dashboard('Такого проекта не существует') unless @projects.include?(@project)
    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
UPDATE `projects` SET `updated_at` = '2009-05-17 16:55:39', `title` = 'Проект Тест' WHERE `id` = 3

  def destroy
    @project = Project.find(params[:id])
	return redirect_to_dashboard('Такого проекта не существует') unless @projects.include?(@project)
    @project.destroy
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
DELETE FROM `projects` WHERE `id` = 1