8/Курсовой/СидоровИС-521703/src/app/controllers/roles_controller.rb

  def index
	@roles = @project.roles.all
---
SELECT * FROM `roles` WHERE (`roles`.project_id = 1)

  def show
    @role = @project.roles.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 953125641 AND (`roles`.project_id = 2))

  def edit
    @role = @project.roles.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 953125641 AND (`roles`.project_id = 2))

  def create
    @role = @project.roles.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO `roles` (`created_at`, `title`, `project_id`, `role_template_id`, `updated_at`, `user_id`, `description`) VALUES('2009-05-17 14:21:18', 'hello', 2, 2, '2009-05-17 14:21:18', 2, 'world')

  def update
    @role = @project.roles.find(params[:id])

    respond_to do |format|
      if @role.update_attributes(params[:role])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 953125641 AND (`roles`.project_id = 2))
UPDATE `roles` SET `updated_at` = '2009-05-17 14:19:11', `description` = 'он разработчик\r\nон всё тут делает' WHERE `id` = 5

  def destroy
    @role = @project.roles.find(params[:id])
    @role.destroy
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 953125641 AND (`roles`.project_id = 2))
DELETE FROM `roles` WHERE `id` = 953125641