8/Курсовой/СидоровИС-521703/src/app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.project_id = 1)
---
  def index
	@tasks = @project.tasks.all

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 953125641 AND (`tasks`.project_id = 1))
---
  def show
    @task = @project.tasks.find(params[:id])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 953125641 AND (`tasks`.project_id = 1))
---
  def edit
    @task = @project.tasks.find(params[:id])

INSERT INTO `tasks` (`created_at`, `title`, `task_status_id`, `project_id`, `updated_at`, `description`) VALUES('2009-05-17 14:38:12', 'task', 953125641, 1, '2009-05-17 14:38:12', 'sddd')
---
  def create
    @task = @project.tasks.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 953125641 AND (`tasks`.project_id = 1))
---
  def update
    @task = @project.tasks.find(params[:id])

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 953125641 AND (`tasks`.project_id = 1))
DELETE FROM `tasks` WHERE `id` = 953125641
---
  def destroy
    @task = @project.tasks.find(params[:id])

    @task.destroy