8/Курсовой/СидоровИС-521703/src/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `role_id`, `remember_token`, `login`, `email`) VALUES('', '4c64fe2ba311b05019e939097f9dc6ce23284ca8', '2009-05-17 14:21:18', 'ae7cdb10d1c01fececdadf2fe331f4269c306c23', NULL, '2009-05-17 14:21:18', NULL, NULL, 'quire', 'quire@example.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save