8/TISPIS/Labs/Additional/webeko/app/controllers/integer_variables_controller.rb

SELECT * FROM `integer_variables`
---
  def index
    @integer_variables = IntegerVariable.all

SELECT * FROM `integer_variables` WHERE (`integer_variables`.`id` = 1)
---
  def show
    @integer_variable = IntegerVariable.find(params[:id])

INSERT INTO `integer_variables` (`created_at`, `title`, `updated_at`, `value`, `description`) VALUES('2009-05-18 08:03:57', '', '2009-05-18 08:03:57', 0, '')
---
  def create
	@integer_variable = IntegerVariable.new(params[:integer_variable])
	value = params[:integer_variable][:value]
	if value != value.to_i.to_s
		@integer_variable.errors.add("Can't save integer value with non integer (#{value}) value","")
		render :action => :new
	else
    respond_to do |format|
      if @integer_variable.save

SELECT * FROM `integer_variables` WHERE (`integer_variables`.`id` = 1)
DELETE FROM `integer_variables` WHERE `id` = 1
---
  def destroy
    @integer_variable = IntegerVariable.find(params[:id])
    @integer_variable.destroy