8/TISPIS/Labs/Additional/webeko/app/controllers/rules_controller.rb

SELECT * FROM `rules`
---
  def index
    @rules = Rule.all

SELECT * FROM `rules` WHERE (`rules`.`id` = 1)
---
  def show
    @rule = Rule.find(params[:id])

SELECT * FROM `rules` WHERE (`rules`.`id` = 8)
---
  def edit
    @rule = Rule.find(params[:id])

INSERT INTO `rules` (`created_at`, `title`, `is_integer`, `updated_at`, `string_variable_id`, `description`, `integer_variable_id`, `is_string`) VALUES('2009-05-18 07:19:06', '', 0, '2009-05-18 07:19:06', NULL, '', NULL, 0)
---
  def create
    @rule = Rule.new( params[:rule] )
	@rule.is_integer = @rule.is_string = false;
	@rule.is_string = true if params[:string_integer] == "2"
	@rule.is_integer = true if params[:string_integer] == "1"

    respond_to do |format|
      if @rule.save

SELECT * FROM `rules` WHERE (`rules`.`id` = 1)
DELETE FROM `rules` WHERE `id` = 1
---
  def destroy
    @rule = Rule.find(params[:id])
    @rule.destroy