8/TISPIS/Labs/Additional/webeko/app/controllers/scenarios_controller.rb

SELECT * FROM `scenarios`
SELECT max(`scenarios`.id) AS max_id FROM `scenarios`
---
  def index
    @scenarios = Scenario.all

SELECT * FROM `scenarios` WHERE (`scenarios`.`id` = 1)
---
  def show
    @scenario = Scenario.find(params[:id])

INSERT INTO `scenarios` (`created_at`, `title`, `updated_at`, `description`, `sort`, `rule_id`) VALUES('2009-05-18 09:24:57', 'nice', '2009-05-18 09:24:57', 'all good', NULL, 10)
---
  def create
    @scenario = Scenario.new(params[:scenario])

    respond_to do |format|
      if @scenario.save

SELECT * FROM `scenarios` WHERE (`scenarios`.`id` = 1)
DELETE FROM `scenarios` WHERE `id` = 1
---
  def destroy
    @scenario = Scenario.find(params[:id])
    @scenario.destroy