8/TISPIS/Labs/Additional/webeko/app/controllers/string_variables_controller.rb

SELECT * FROM `string_variables`
---
  def index
    @string_variables = StringVariable.all

SELECT * FROM `string_variables` WHERE (`string_variables`.`id` = 1)
---
  def show
    @string_variable = StringVariable.find(params[:id])

INSERT INTO `string_variables` (`created_at`, `title`, `updated_at`, `value`, `description`) VALUES('2009-05-18 08:02:51', '', '2009-05-18 08:02:51', '', '')
---
  def create
    @string_variable = StringVariable.new(params[:string_variable])

    respond_to do |format|
      if @string_variable.save

SELECT * FROM `string_variables` WHERE (`string_variables`.`id` = 1)
DELETE FROM `string_variables` WHERE `id` = 1
---
  def destroy
    @string_variable = StringVariable.find(params[:id])
    @string_variable.destroy