8/CL&LI/Lab3/speaker/app/controllers/words_controller.rb

  def show
    @word = Word.find(params[:id])
---
SELECT * FROM `words` WHERE (`words`.`id` = 953125641)

  def edit
    @word = Word.find(params[:id])
---
SELECT * FROM `words` WHERE (`words`.`id` = 953125641)

  def update
    @word = Word.find(params[:id])
---
SELECT * FROM `words` WHERE (`words`.`id` = 953125641)

  def destroy
    @word = Word.find(params[:id])
    @word.destroy
---
SELECT * FROM `words` WHERE (`words`.`id` = 953125641)
DELETE FROM `words` WHERE `id` = 953125641