8/CL&LI/Lab3/speaker/app/controllers/word_groups_controller.rb

  def show
    @word_group = WordGroup.find(params[:id])
---
SELECT * FROM `word_groups` WHERE (`word_groups`.`id` = 953125641)

  def edit
    @word_group = WordGroup.find(params[:id])
---
SELECT * FROM `word_groups` WHERE (`word_groups`.`id` = 953125641)

  def create
    @word_group = WordGroup.new(params[:word_group])

    respond_to do |format|
      if @word_group.save
---
INSERT INTO `word_groups` (`created_at`, `word_type_id`, `title`, `updated_at`, `template`) VALUES('2009-05-24 17:10:38', NULL, NULL, '2009-05-24 17:10:38', NULL)

  def update
    @word_group = WordGroup.find(params[:id])
---
SELECT * FROM `word_groups` WHERE (`word_groups`.`id` = 953125641)

  def destroy
    @word_group = WordGroup.find(params[:id])
    @word_group.destroy
---
SELECT * FROM `word_groups` WHERE (`word_groups`.`id` = 953125641)
DELETE FROM `word_groups` WHERE `id` = 953125641