8/CL&LI/Lab3/speaker/app/controllers/word_forms_controller.rb

  def show
    @word_form = WordForm.find( params[:id] )
---
SELECT * FROM `word_forms` WHERE (`word_forms`.`id` = 953125641)

  def edit
    @word_form = WordForm.find(params[:id])
---
SELECT * FROM `word_forms` WHERE (`word_forms`.`id` = 953125641)

  def create
    @word_form = WordForm.new(params[:word_form])

    respond_to do |format|
      if @word_form.save
---
INSERT INTO `word_forms` (`created_at`, `updated_at`, `word_group_id`, `content`) VALUES('2009-05-24 17:10:38', '2009-05-24 17:10:38', NULL, NULL)

  def update
    @word_form = WordForm.find(params[:id])
---
SELECT * FROM `word_forms` WHERE (`word_forms`.`id` = 953125641)

  def destroy
    @word_form = WordForm.find(params[:id])
    @word_form.destroy
---
SELECT * FROM `word_forms` WHERE (`word_forms`.`id` = 953125641)
DELETE FROM `word_forms` WHERE `id` = 953125641