8/Курсовой/СидоровИС-521703/src/app/controllers/admin/bug_statuses_controller.rb

SELECT * FROM `bug_statuses`
---
  def index
    @bug_statuses = BugStatus.all

SELECT * FROM `bug_statuses` WHERE (`bug_statuses`.`id` = 953125641)
---
  def show
    @bug_status = BugStatus.find(params[:id])

SELECT * FROM `bug_statuses` WHERE (`bug_statuses`.`id` = 953125641)
---
  def edit
    @bug_status = BugStatus.find(params[:id])

INSERT INTO `bug_statuses` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-05-17 14:21:17', 'title', '2009-05-17 14:21:17', 'description')
---
  def create
    @bug_status = BugStatus.new(params[:bug_status])

    respond_to do |format|
      if @bug_status.save

SELECT * FROM `bug_statuses` WHERE (`bug_statuses`.`id` = 953125641)
---
  def update
    @bug_status = BugStatus.find(params[:id])

SELECT * FROM `bug_statuses` WHERE (`bug_statuses`.`id` = 953125641)
DELETE FROM `bug_statuses` WHERE `id` = 953125641
DELETE FROM `bugs` WHERE `id` = 996332877
---
  def destroy
    @bug_status = BugStatus.find(params[:id])
    @bug_status.destroy