8/Курсовой/СидоровИС-521703/src/app/controllers/admin/build_statuses_controller.rb

SELECT * FROM `build_statuses`
---
  def index
    @build_statuses = BuildStatus.all

SELECT * FROM `build_statuses` WHERE (`build_statuses`.`id` = 953125641)
---
  def show
    @build_status = BuildStatus.find(params[:id])

SELECT * FROM `build_statuses` WHERE (`build_statuses`.`id` = 953125641)
---
  def edit
    @build_status = BuildStatus.find(params[:id])

INSERT INTO `build_statuses` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-05-17 14:21:17', 'hello', '2009-05-17 14:21:17', 'world')
---
  def create
    @build_status = BuildStatus.new(params[:build_status])

    respond_to do |format|
      if @build_status.save

SELECT * FROM `build_statuses` WHERE (`build_statuses`.`id` = 953125641)
---
  def update
    @build_status = BuildStatus.find(params[:id])

SELECT * FROM `build_statuses` WHERE (`build_statuses`.`id` = 953125641)
DELETE FROM `build_statuses` WHERE `id` = 953125641
DELETE FROM `builds` WHERE `id` = 953125641
---
  def destroy
    @build_status = BuildStatus.find(params[:id])
    @build_status.destroy