8/Курсовой/СидоровИС-521703/src/app/controllers/admin/issue_statuses_controller.rb

  def index
    @issue_statuses = IssueStatus.all
---
SELECT * FROM `issue_statuses`

  def show
    @issue_status = IssueStatus.find(params[:id])
---
SELECT * FROM `issue_statuses` WHERE (`issue_statuses`.`id` = 2)

  def edit
    @issue_status = IssueStatus.find(params[:id])
---
SELECT * FROM `issue_statuses` WHERE (`issue_statuses`.`id` = 2)

  def create
    @issue_status = IssueStatus.new(params[:issue_status])

    respond_to do |format|
      if @issue_status.save
---
INSERT INTO `issue_statuses` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-05-17 14:21:17', 'some title', '2009-05-17 14:21:17', 'description')

  def update
    @issue_status = IssueStatus.find(params[:id])
---
SELECT * FROM `issue_statuses` WHERE (`issue_statuses`.`id` = 2)

  def destroy
    @issue_status = IssueStatus.find(params[:id])
    @issue_status.destroy
---
SELECT * FROM `issue_statuses` WHERE (`issue_statuses`.`id` = 2)
DELETE FROM `issue_statuses` WHERE `id` = 2
DELETE FROM `issues` WHERE `id` = 953125641