8/Курсовой/СидоровИС-521703/src/app/controllers/admin/project_statuses_controller.rb

  def index
    @project_statuses = ProjectStatus.all
---
SELECT * FROM `project_statuses`

  def show
    @project_status = ProjectStatus.find(params[:id])
---
SELECT * FROM `project_statuses` WHERE (`project_statuses`.`id` = 953125641)

  def edit
    @project_status = ProjectStatus.find(params[:id])
---
SELECT * FROM `project_statuses` WHERE (`project_statuses`.`id` = 953125641)

  def create
    @project_status = ProjectStatus.new(params[:project_status])

    respond_to do |format|
      if @project_status.save
---
INSERT INTO `project_statuses` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-05-17 14:21:17', 'Help', '2009-05-17 14:21:17', 'ole')

  def update
    @project_status = ProjectStatus.find(params[:id])
---
SELECT * FROM `project_statuses` WHERE (`project_statuses`.`id` = 953125641)

  def destroy
    @project_status = ProjectStatus.find(params[:id])
    @project_status.destroy
---
SELECT * FROM `project_statuses` WHERE (`project_statuses`.`id` = 953125641)
DELETE FROM `project_statuses` WHERE `id` = 953125641
DELETE FROM `projects` WHERE `id` = 1