8/Курсовой/СидоровИС-521703/src/app/controllers/admin/projects_controller.rb

  def index
    @all_projects = Project.all
---
SELECT * FROM `projects`