8/Курсовой/СидоровИС-521703/src/app/controllers/admin/right_templates_controller.rb

  def find_role
	@role = RoleTemplate.find(params[:role_template_id])
---
SELECT * FROM `role_templates` WHERE (`role_templates`.`id` = 2)

  def show
    @right_template = @role.right_templates.find( params[:id] )
---
SELECT * FROM `right_templates` WHERE (`right_templates`.`id` = 953125641 AND (`right_templates`.role_template_id = 2))

  def edit
    @right_template = @role.right_templates.find(params[:id])
---
SELECT * FROM `right_templates` WHERE (`right_templates`.`id` = 953125641 AND (`right_templates`.role_template_id = 2))

  def create
    @right_template = @role.right_templates.new(params[:right_template])

    respond_to do |format|
      if @right_template.save
---
INSERT INTO `right_templates` (`actions`, `created_at`, `title`, `role_template_id`, `updated_at`, `write_ids`, `read_ids`, `description`, `controller`) VALUES(NULL, '2009-05-17 14:21:17', 'ole', 2, '2009-05-17 14:21:17', NULL, NULL, 'ole', NULL)

  def update
    @right_template = @role.right_templates.find(params[:id])
---
SELECT * FROM `right_templates` WHERE (`right_templates`.`id` = 953125641 AND (`right_templates`.role_template_id = 2))

  def destroy
    @right_template = @role.right_templates.find(params[:id])
    @right_template.destroy
---
SELECT * FROM `right_templates` WHERE (`right_templates`.`id` = 953125641 AND (`right_templates`.role_template_id = 2))
DELETE FROM `right_templates` WHERE `id` = 953125641