8/Курсовой/СидоровИС-521703/src/app/controllers/admin/role_templates_controller.rb

SELECT * FROM `role_templates`
---
  def index
    @role_templates = RoleTemplate.all

SELECT * FROM `role_templates` WHERE (`role_templates`.`id` = 1)
---
  def show
    @role_template = RoleTemplate.find(params[:id])

SELECT * FROM `role_templates` WHERE (`role_templates`.`id` = 1)
---
  def edit
    @role_template = RoleTemplate.find(params[:id])

INSERT INTO `role_templates` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-05-17 14:21:17', 'RoleName', '2009-05-17 14:21:17', 'desc')
---
  def create
    @role_template = RoleTemplate.new(params[:role_template])

    respond_to do |format|
      if @role_template.save

SELECT * FROM `role_templates` WHERE (`role_templates`.`id` = 1)
---
  def update
    @role_template = RoleTemplate.find(params[:id])

SELECT * FROM `role_templates` WHERE (`role_templates`.`id` = 1)
DELETE FROM `role_templates` WHERE `id` = 1
DELETE FROM `roles` WHERE `id` = 953125641
---
  def destroy
    @role_template = RoleTemplate.find(params[:id])
    @role_template.destroy