8/Курсовой/СидоровИС-521703/src/app/controllers/admin/roles_controller.rb

SELECT * FROM `roles` WHERE (`roles`.user_id = 1)
---
  def index
    @roles = Role.all

SELECT * FROM `roles` WHERE (`roles`.user_id = 1)
---
  def edit
    @role = Role.find(params[:id])