8/Курсовой/СидоровИС-521703/src/app/controllers/admin/task_statuses_controller.rb

  def index
    @task_statuses = TaskStatus.all
---
SELECT * FROM `task_statuses`

  def show
    @task_status = TaskStatus.find(params[:id])
---
SELECT * FROM `task_statuses` WHERE (`task_statuses`.`id` = 953125641)

  def edit
    @task_status = TaskStatus.find(params[:id])
---
SELECT * FROM `task_statuses` WHERE (`task_statuses`.`id` = 953125641)

  def create
    @task_status = TaskStatus.new(params[:task_status])

    respond_to do |format|
      if @task_status.save
---
INSERT INTO `task_statuses` (`created_at`, `title`, `updated_at`, `description`) VALUES('2009-05-17 14:21:17', 'ano', '2009-05-17 14:21:17', 'nymous')

  def update
    @task_status = TaskStatus.find(params[:id])
---
SELECT * FROM `task_statuses` WHERE (`task_statuses`.`id` = 953125641)

  def destroy
    @task_status = TaskStatus.find(params[:id])
    @task_status.destroy
---
SELECT * FROM `task_statuses` WHERE (`task_statuses`.`id` = 953125641)
DELETE FROM `task_statuses` WHERE `id` = 953125641
DELETE FROM `tasks` WHERE `id` = 953125641